{
  "irVersion": "3",
  "producerName": "ML.NET",
  "producerVersion": "0.2.0.0000",
  "domain": "com.baseballsample",
  "graph": {
    "node": [
      {
        "input": [
          "YearsPlayed",
          "AB",
          "R",
          "H",
          "Doubles",
          "Triples",
          "HR",
          "RBI",
          "SB",
          "AllStarAppearances",
          "MVPs",
          "TripleCrowns",
          "GoldGloves",
          "MajorLeaguePlayerOfTheYearAwards",
          "TB"
        ],
        "output": [
          "Features"
        ],
        "name": "FeatureVectorizer",
        "opType": "FeatureVectorizer",
        "attribute": [
          {
            "name": "inputList",
            "strings": [
              "WWVhcnNQbGF5ZWQ=",
              "QUI=",
              "Ug==",
              "SA==",
              "RG91Ymxlcw==",
              "VHJpcGxlcw==",
              "SFI=",
              "UkJJ",
              "U0I=",
              "QWxsU3RhckFwcGVhcmFuY2Vz",
              "TVZQcw==",
              "VHJpcGxlQ3Jvd25z",
              "R29sZEdsb3Zlcw==",
              "TWFqb3JMZWFndWVQbGF5ZXJPZlRoZVllYXJBd2FyZHM=",
              "VEI="
            ],
            "type": "STRINGS"
          },
          {
            "name": "inputdimensions",
            "ints": [
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features"
        ],
        "output": [
          "Score"
        ],
        "name": "TreeEnsembleRegressor",
        "opType": "TreeEnsembleRegressor",
        "attribute": [
          {
            "name": "post_transform",
            "s": "Tk9ORQ==",
            "type": "STRING"
          },
          {
            "name": "n_targets",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "base_values",
            "floats": [
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "aggregate_function",
            "s": "U1VN",
            "type": "STRING"
          },
          {
            "name": "nodes_treeids",
            "ints": [
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "1",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "2",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "3",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "4",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "5",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "6",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "7",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "8",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "9",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "10",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "11",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "12",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "13",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "14",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "15",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "16",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "17",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "18",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "19",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "20",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "21",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "22",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "23",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "24",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "25",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "26",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "27",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "28",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "29",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "30",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "31",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "32",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "33",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "34",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "35",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "36",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "37",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "38",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "39",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "40",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "41",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "42",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "43",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "44",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "45",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "46",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "47",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "48",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "49",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "50",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "51",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "52",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "53",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "54",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "55",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "56",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "57",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "58",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59",
              "59"
            ],
            "type": "INTS"
          },
          {
            "name": "nodes_nodeids",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18",
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10",
              "11",
              "12",
              "13",
              "14",
              "15",
              "16",
              "17",
              "18"
            ],
            "type": "INTS"
          },
          {
            "name": "nodes_featureids",
            "ints": [
              "9",
              "2",
              "2",
              "9",
              "10",
              "7",
              "7",
              "5",
              "10",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "9",
              "2",
              "2",
              "9",
              "10",
              "8",
              "5",
              "0",
              "7",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "9",
              "2",
              "2",
              "9",
              "5",
              "6",
              "6",
              "6",
              "5",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "9",
              "2",
              "2",
              "9",
              "12",
              "5",
              "5",
              "6",
              "10",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "9",
              "2",
              "2",
              "9",
              "12",
              "5",
              "5",
              "5",
              "7",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "2",
              "10",
              "5",
              "6",
              "9",
              "2",
              "12",
              "2",
              "1",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
              "2",
              "10",
              "5",
              "6",
              "9",
              "12",
              "2",
              "2",
              "1",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0",
